#Мазалевская Вариант 4
print(f"start code...")
books=[#создаем список из словарей
    {
        "title":"Спеши любить",
        "author":"Николас Спаркс",
        "year":1999
    },
    {
        "title":"А зори здесь тихие",
        "author":"Борис Васильев",
        "year":1969 
    },
    {
         "title":"Убийство в Восточном экспрессе",
        "author":"Агата Кристи",
        "year":1934
    },
    {
         "title":"Оно",
        "author":"Стивен Кинг",
        "year":1986
    },
    {
         "title":"Внутри убийцы",
        "author":"Майк Омер",
        "year":2018
    }
]
for i, inf in enumerate(books,1):#перебираем список книг
    print(f"---------------Книга {i}---------------")#выводим книгу с номером
    print(f"Название: {inf["title"]}, Автор: {inf["author"]}")#выводим название и автора текущей книги
    print(f"----------------{inf["year"]}----------------")#выводим год издания книги
    print("\n")#создаем отступ между информацией о книгах
print(f"end code...")
